{
  "nav": {
    "title": "BlockBenny",
    "home": "Home",
    "techStack": "Tech Stack",
    "resume": "Resume",
    "about": "About Me"
  },
  "home": {
    "title": "Hey, my name is",
    "title1": "Benjamin Arand",
    "title2": "and I am a",
    "title3": "Full Stack & Blockchain Developer"
  },
  "techStack": {
    "languages": {
      "title": "Languages",
      "values": [
        {
          "x": "C#",
          "y": 4
        },
        {
          "x": "SQL",
          "y": 4
        },
        {
          "x": "JS",
          "y": 4
        },
        {
          "x": "Solidity",
          "y": 4
        },
        {
          "x": "HTML",
          "y": 3
        },
        {
          "x": "Python",
          "y": 3
        },
        {
          "x": "JAVA",
          "y": 2
        },
        {
          "x": "VBScript",
          "y": 2
        },
        {
          "x": "GO",
          "y": 2
        },
        {
          "x": "PHP",
          "y": 2
        },
        {
          "x": "Ruby",
          "y": 1
        }
      ]
    },
    "frameworks": {
      "title": "Framework & DBs",
      "values": [
        {
          "x": ".NET",
          "y": 4
        },
        {
          "x": "Node",
          "y": 4
        },
        {
          "x": "MSSQL",
          "y": 4
        },
        {
          "x": "MongoDB",
          "y": 3
        },
        {
          "x": "Vue.js",
          "y": 3
        },
        {
          "x": "React.js",
          "y": 3
        },
        {
          "x": "Tailwind",
          "y": 3
        },
        {
          "x": "Bootstrap",
          "y": 3
        },
        {
          "x": "Web3.js",
          "y": 3
        },
        {
          "x": "Ether.js",
          "y": 3
        },
        {
          "x": "JQuery",
          "y": 2
        },
        {
          "x": "RoR",
          "y": 1
        }
      ]
    },
    "tools": {
      "title": "Tools & Hosting",
      "values": [
        {
          "x": "Asana",
          "y": 5
        },
        {
          "x": "Slab",
          "y": 5
        },
        {
          "x": "VS",
          "y": 5
        },
        {
          "x": "Azure DevOps",
          "y": 4
        },
        {
          "x": "Git",
          "y": 4
        },
        {
          "x": "Remix",
          "y": 4
        },
        {
          "x": "Linode",
          "y": 4
        },
        {
          "x": "AWS",
          "y": 3
        },
        {
          "x": "Jira",
          "y": 2
        },
        {
          "x": "Slack",
          "y": 1
        }
      ]
    },
    "softSkills": {
      "title": "Soft Skills",
      "values": [
        {
          "x": "Remote",
          "y": 5
        },
        {
          "x": "German",
          "y": 5
        },
        {
          "x": "English",
          "y": 4
        },
        {
          "x": "Pr. Management",
          "y": 4
        },
        {
          "x": "Communication",
          "y": 4
        },
        {
          "x": "Leadership",
          "y": 4
        },
        {
          "x": "Trainer",
          "y": 3
        }
      ]
    }
  },
  "resumes": [
    {
      "topic": "School & University",
      "firstTitle": "Employee",
      "firstValue": "TUM & LMU 2011-2014",
      "secondTitle": "Tech",
      "secondValue": "JAVA, HTML, JS, CSS, Perl, Eclipse, Git",
      "description": "<p className='pb-5'>After completing high school, I moved to Munich and studied Electrical and Information Technologies at the 'Technical University Munich' (TUM).</p><br/><p>However, I switched to the teaching degree in Computer Science and Physics at the 'Ludwigs Maximilian Universität' (LMU) because I was more interested in programming and enjoyed working with people.</p><br/><p>After two semesters and an internship, I realized that a school environment may not be the right fit for me.</p>"
    },
    {
      "topic": "Further Education",
      "firstTitle": "Employee",
      "firstValue": "Muenchener Verein 2014-2016",
      "secondTitle": "Tech",
      "secondValue": "JAVA, COBOL, BAT, PS, HTML, JS, CSS, Perl, JIRA, Eclipse, Siemens BS2000, Jenkins, Git",
      "description": "<p className='pb-5'>After my studies at the Universities of Munich, I was trained as an application developer at Münchner Verein e.V. The apprentices were taught in blocks at CSS Academy and received training in various programming languages, frameworks, networks and soft skills.</p><br/><p>I worked with COBOL on a Siemens BS2000 for two years and developed and maintained full-stack applications with Oracle, JAVA, and web technologies.</p>"
    },
    {
      "topic": "Becoming a Full Stack Developer",
      "firstTitle": "Employee",
      "firstValue": "Megatech communicatin GmbH 2016-2018",
      "secondTitle": "Tech",
      "secondValue": "C# .NET, C++, JAVA, BAT, PS, VBScript, JS, HTML/CSS, SQL, MS Teams, Git, MSSQL, Oracle",
      "description": "<p className='pb-5'>I moved back to the Bavarian Forest and started working as a Full Stack Developer at Megatech communication GmbH. I gained full-stack skills and was responsible for complete systems.</p><br/><p> My first major project was the company's web shop based on ASP.NET, which I worked on in terms of database structures, e-commerce, scripting, server-client architecture, security, and web technologies.</p>"
    },
    {
      "topic": "Project Management B2B",
      "firstTitle": "Employee",
      "firstValue": "Megatech communicatin GmbH 2018-Jetzt",
      "secondTitle": "Skills",
      "secondValue": "Project Management, Customer communication, Consulting",
      "description": "<p className='pb-5'>After gaining experience as a developer, I wanted to learn more and took on project management for internal projects. </p><br/><p> Recently, I have been responsible for developing software products for customers, including consulting, project planning, development, testing, acceptance, and installation.</p><br/><p> I learned a lot about customer communication, consulting, project planning, resource planning, product development, version management, and more.</p>"
    },
    {
      "topic": "Trainer / Instructor",
      "firstTitle": "Employee",
      "firstValue": "WenServices 2020-Jetzt",
      "secondTitle": "Skills",
      "secondValue": "HR, Leadership, Trainings / Instructions",
      "description": "<p className='pb-5'>Because I've always enjoyed working with people, I had the opportunity to take on the position of head instructor.</p><br/><p>During this time I hired and supervised more than eight trainees and prepared them for their final exams.</p><br/><p>During this time I was able to gain a lot of experience in the areas of personnel management, communication, planning, training and lectures.</p>"
    },
    {
      "topic": "Full Stack Technologies",
      "firstTitle": "Employee",
      "firstValue": "Megatech communicatin GmbH 2016-Jetzt",
      "secondTitle": "Tech",
      "secondValue": "C# .NET, C++, JAVA, BAT, PS, VBScript, JS, HTML/CSS, SQL",
      "description": "<p className='pb-5'>I have gained experience with new technologies and worked on internal and external projects. Our team has developed and distributed software products, including a UC client, a wallboard system, a ticket and working time management tool, e-commerce applications, and more.</p><br/><p>I have learned about Javascript/Typescript, Node.js, Vue.js, Webservices, Microservices, HTML/CSS, Bootstrap, MSSQL, Oracle, MongoDB, and have worked with backend services in C# .NET, Java, and Python.</p>"
    },
    {
      "topic": "Blockchain",
      "firstTitle": "Employee",
      "firstValue": "Privat (2018-jetzt)",
      "secondTitle": "Tech",
      "secondValue": "Solidity, EVM, Remix, web3.js, ether.js, LINK, DOT",
      "description": "<p className='pb-5'>I heard about blockchain in 2012 but didn't really get interested in it until 2018. I read a lot, watched videos, studied whitepapers and then became part of a crypto project as Customer service representative and developer.</p><br/><p> There I was able to gain insight into the processes of a decentralized company and learned communicating in english.</p><br/><p>However, the project had to be financed almost all employees laid off.</p>"
    },
    {
      "topic": "Founding WenServices",
      "firstTitle": "Employee",
      "firstValue": "Privat 2022 - Jetzt",
      "secondTitle": "Skills",
      "secondValue": "StartUp Management, Leadership, Negotiation, Company Management",
      "description": "<p className='pb-5'>Last year I founded WenServices with a friend from Denmark. We are developing a management SaaS product for blockchain businesses in our spare time.</p><br/><p>I gained experience in leadership, Start-up, project management, communication, acquisition, content creation, social media, blockchain development and more.</p><br/><p> I developed my own token and solidity-based blockchain website BetWithFriends, wrote bots and built websites using react.js and vue.js.</p>"
    },
    {
      "topic": "Hosting & Administration",
      "firstTitle": "Employee",
      "firstValue": "Everyone",
      "secondTitle": "Skills",
      "secondValue": "Azure, AWS, Linode, Apache, Docker, Kubernetes, CI",
      "description": "<p className='pb-5'>As a full-stack developer and founder of a start-up, you don't just have to worry about databases and software. You also have to acquire knowledge of networks and hosting.</p> <br/><p> In order to host our microservices, proxies and websites, I have gained a lot of experience with AWS and its environment. I have also gained a lot of experience with Docker, Kubernetes, Apache and various Linux distributions.</p> <br/><p> At Megatech I also had the opportunity to gain and implement experience in virtualization with VSphere.</p>"
    }
  ],
  "about": {
    "description": "<p>I am a 31-year-old stepfather, loving husband, and generally content individual living in Germany.</p><br/><p>As Full Stack Developer with over 8 years of experience, I am a highly skilled and dedicated professional. In my previous role as a Full Stack Developer at a medium-sized telecommunications company, I was able to help establish a brand new software department from the ground up. This gave me the opportunity to take on various roles including Project Manager, Instructor, Consultant, and Support.</p><br/><p>In addition to my technical skills, I am also a strong communicator with fluency in English, as well as a business-minded individual who always keeps the success of the company in mind. I have also gained valuable experience in start-up management, team leadership, and negotiation through my side project, WenServices, a software company that is developing a Management SaaS solution for crypto businesses.</p><br/><p>One of my greatest strengths is my ability to learn quickly and fully commit to my work. I am also an innovative and entrepreneurial thinker. However, I do struggle with multitasking and occasionally have too many ideas bouncing around in my head at once. Despite this, I have found that using chatGPT as a personal assistant has significantly increased my work efficiency by at least 30%. I believe that with the use of AI-based assistance, we have the potential to increase efficiency by 2-10 times in the coming years.</p><br/><p>Overall, I am confident in my ability to excel in remote work environments and consistently deliver excellent results.</p>"
  }
}