{
    "nav": {
        "title": "BlockBenny",
        "home": "Home",
        "techStack": "Tech Stack",
        "resume": "Resume",
        "about": "About Me"
    },
    "home": {
        "title": "<div className='mt-14 text-2xl'>Hey, my name is</div><div className='mt-1 home-title text-textPink font-playB'>Benjamin Arand</div><div className='mt-10 text-2xl'>and I am a</div><div className='mt-1 home-title text-textPink font-playB'>Full Stack & Blockchain Developer</div>"
    },
    "techStack": {
        "languages": {
            "title": "Languages",
            "values": [
                {
                    "x": "C#a .NET",
                    "y": 4
                },
                {
                    "x": "SQL",
                    "y": 4
                },
                {
                    "x": "JS / TS",
                    "y": 4
                },
                {
                    "x": "Solidity",
                    "y": 4
                },
                {
                    "x": "HTML / CSS",
                    "y": 3
                },
                {
                    "x": "Python",
                    "y": 3
                },
                {
                    "x": "JAVA",
                    "y": 2
                },
                {
                    "x": "VBScript",
                    "y": 2
                },
                {
                    "x": "GO",
                    "y": 2
                },
                {
                    "x": "PHP",
                    "y": 2
                },
                {
                    "x": "Ruby",
                    "y": 1
                }
            ]
        },
        "frameworks": {
            "title": "Framework & DBs",
            "values": [
                {
                    "x": ".NET",
                    "y": 4
                },
                {
                    "x": "Node / Express JS",
                    "y": 4
                },
                {
                    "x": "MSSQL / Oracle",
                    "y": 4
                },
                {
                    "x": "MongoDB",
                    "y": 3
                },
                {
                    "x": "React.js / Vue.js / Nuxt.js",
                    "y": 3
                },
                {
                    "x": "Tailwind CSS",
                    "y": 3
                },
                {
                    "x": "Bootstrap",
                    "y": 3
                },
                {
                    "x": "Web3.js / Ether.js",
                    "y": 3
                },
                {
                    "x": "JQuery",
                    "y": 2
                },
                {
                    "x": "RoR",
                    "y": 1
                }
            ]
        },
        "tools": {
            "title": "Tools & Hosting",
            "values": [
                {
                    "x": "Asana",
                    "y": 5
                },
                {
                    "x": "Slab",
                    "y": 5
                },
                {
                    "x": "VS / VSCode",
                    "y": 5
                },
                {
                    "x": "MS Teams / Azure DevOps",
                    "y": 4
                },
                {
                    "x": "Google Workspace",
                    "y": 4
                },
                {
                    "x": "Git / GitHub / GitLab",
                    "y": 4
                },
                {
                    "x": "Remix",
                    "y": 4
                },
                {
                    "x": "Linode",
                    "y": 4
                },
                {
                    "x": "AWS",
                    "y": 3
                },
                {
                    "x": "Jira",
                    "y": 2
                },
                {
                    "x": "Slack",
                    "y": 1
                }
            ]
        },
        "softSkills": {
            "title": "Soft Skills",
            "values": [
                {
                    "x": "Remote Work (It is a Skill)",
                    "y": 5
                },
                {
                    "x": "German",
                    "y": 5
                },
                {
                    "x": "English",
                    "y": 4
                },
                {
                    "x": "Project Management",
                    "y": 4
                },
                {
                    "x": "Active Communication",
                    "y": 4
                },
                {
                    "x": "Leadership",
                    "y": 4
                },
                {
                    "x": "Trainer",
                    "y": 3
                }
            ]
        }
    },
    "resume": {
        "pageOne": [
            {
                "topic": "Schule & Uni",
                "firstTitle": "Arbeitgeber",
                "firstValue": "Muenchener Verein eG 2014-2016",
                "secondTitle": "Sprachen",
                "secondValue": "JAVA, COBOL, BAT, PS, HTML, JS, CSS, Perl",
                "thirdTitle": "Tech",
                "thirdValue": "JIRA, Eclipse, Siemens BS2000, Jenkins, Git",
                "description": "<p className='pb-5'>Im Jahr 2011 absolvierte ich erfolgreich mein Abitur am Gymnasium Zwiesel. Anschließend entschied ich mich dafür, wegzuziehen und an der Universität in München zu studieren. Zunächst habe ich mich für den Studiengang Elektro- und Informationstechnologien an der Technischen Universität München (TUM) eingeschrieben, jedoch schnell festgestellt, dass mir das Studium zu sehr auf Theorie ausgelegt war und ich vorrangig das Programmieren lernen wollte. Aus diesem Grund wechselte ich in den Studiengang Lehramt Informatik und Physik an der Ludwig-Maximilians-Universität München (LMU). Der Grund für den Wechsel war auch, dass ich gerne mit Menschen arbeiten wollte. Nach Abschluss von zwei Semestern und einem Praktikum wurde mir jedoch bewusst, dass eine schulische Umgebung möglicherweise nicht die richtige für mich ist.</p>"
            },
            {
                "topic": "Ausbildung",
                "firstTitle": "Arbeitgeber",
                "firstValue": "Megatech communicatin GmbH 2016-2018",
                "secondTitle": "Sprachen",
                "secondValue": "C# .NET, C++, JAVA, BAT, PS, VBScript, JS, HTML/CSS, SQL",
                "thirdTitle": "Tech",
                "thirdValue": "MS Teams, Git, MSSQL, Omnitracker, Mention, Oracle",
                "description": "<p className='pb-5'>Nach meinem Studium an der Universität München bot sich mir eine außergewöhnliche Gelegenheit: Der Münchner Verein e.V. suchte neue Auszubildende für die Stelle als Fachinformatiker für Anwendungsentwicklung. Das Besondere an dieser Ausbildung war, dass die Azubis nicht zur Berufsschule gingen, sondern blockweise in der damaligen CSS Akademie unterrichtet wurden. Wir waren insgesamt acht Personen und erhielten intensive Schulungen in Programmiersprachen, Frameworks, Netzwerken und verschiedenen Soft Skills. Nach bestandenem IQ-Test wurde ich eingestellt. In den vergangenen zwei Jahren durfte ich COBOL auf einem Siemens BS2000 lernen und Full-Stack-Entwicklungen mit Oracle, JAVA und Webtechnologien anpassen und betreuen.</p>"
            },
            {
                "topic": "Weg zum Full Stack Developer",
                "firstTitle": "Employee",
                "firstValue": "Megatech communicatin GmbH 2019-2022",
                "secondTitle": "Soft Skills",
                "secondValue": "Projektmanagement, Ressourcenplanung, Agile Entwicklung, Kommunikation, Consulting",
                "description": "<p className='pb-5'>Nach meiner Ausbildung und fünf Jahren Berufserfahrung in München zog ich aus persönlichen Gründen in den Bayerischen Wald zurück. Zu diesem Zeitpunkt suchte die Megatech Communication GmbH nach Software-Entwicklern, weshalb ich mich um eine Stelle bewerben und schlussendlich eingestellt werden konnte. In den ersten zwei Jahren meiner Tätigkeit bei der Megatech Communication GmbH wurde ich in meinen Full-Stack-Fähigkeiten gefördert. Von Anfang an hatte ich die Verantwortung für komplette Systeme und konnte viel über die C# .NET-Welt lernen. Mein erstes großes Projekt war der firmeneigene Webshop auf ASP.NET-Basis. Hier konnte ich mich insbesondere in Bezug auf Datenbankstrukturen, E-Commerce, Skripting, Server-Client-Architektur und Sicherheit sowie Webtechnologien weiterbilden.</p>"
            }
        ],
        "pageTwo": [
            {
                "topic": "Projektmanagement B2B",
                "firstTitle": "Arbeitgeber",
                "firstValue": "Megatech communicatin GmbH 2020-2022",
                "secondTitle": "Programmiersprachen",
                "secondValue": "JAVA, COBOL, BAT, PS, HTML, JS, CSS, Perl",
                "thirdTitle": "Tech",
                "thirdValue": "JIRA, Eclipse, Siemens BS2000, Jenkins, Git",
                "description": "<p className='pb-5'>Nachdem ich mich in meinen Fähigkeiten als Entwickler sicher fühlte, wollte ich neue Dinge lernen und die Gelegenheit nutzen, für einige interne Projekte das Projektmanagement zu übernehmen. In den vergangenen Jahren war ich daher immer wieder dafür verantwortlich, Softwareprodukte für Kunden zu entwickeln. Dies umfasste die Bereiche Consulting, Projektplanung, Entwicklung, Tests, Abnahme und Installation. In dieser Zeit habe ich viel über Kundenkommunikation, Consulting, Projektplanung, Ressourcenplanung, Produktentwicklung, Versionsmanagement und vieles andere gelernt.</p>"
            },
            {
                "topic": "Ausbilder",
                "firstTitle": "Employee",
                "firstValue": "WenServices 2022 - Jetzt",
                "secondTitle": "Soft Skills",
                "secondValue": "Projektmanagement, Ressourcenplanung, Agile Entwicklung, Kommunikation, Consulting",
                "description": "<p className='pb-5'>Da ich schon immer gerne mit Menschen gearbeitet habe, bot sich die Möglichkeit an, die Stelle des leitenden Ausbilders zu übernehmen. In dieser Zeit habe ich mehr als acht Auszubildende eingestellt, betreut und auf ihre Abschlussprüfung vorbereitet. Ich konnte in dieser Zeit viel Erfahrung in den Bereichen Personalmanagement, Kommunikation, Planung, Schulungen und Vorträge sammeln.</p>"
            },
            {
                "topic": "Full Stack Technologien",
                "firstTitle": "Arbeitgeber",
                "firstValue": "Privat 2019 - Jetzt",
                "secondTitle": "Languages",
                "secondValue": "C# .NET, C++, JAVA, BAT, PS, VBScript, JS, HTML/CSS, SQL",
                "thirdTitle": "Tech",
                "thirdValue": "MS Teams, Git, MSSQL, Omnitracker, Mention, Oracle",
                "description": "<p className='pb-5'>Auch auf der Entwicklungsseite hat sich in dieser Zeit einiges getan. Ich habe mich in neue Technologien eingearbeitet und habe an zahlreichen internen und externen Projekten mitgewirkt. In dieser Zeit hat unser Team zahlreiche Softwareprodukte entwickelt und vertrieben, darunter beispielsweise einen UC-Client, ein Wallboard-System, ein internes Ticket- und Arbeitszeiten-Management-Tool, E-Commerce-Anwendungen und vieles mehr. Ich habe viel über Javascript/Typescript, Node.js, Vue.js, Webservices, Microservices, HTML/CSS, Bootstrap, MSSQL, Oracle, MongoDB gelernt und habe auch Backend-Services in C# .NET, Java oder Python geschrieben.</p>"
            }
        ],
        "pageThree": [
            {
                "topic": "Blockchain",
                "firstTitle": "Employee",
                "firstValue": "WenServices 2022 - Jetzt",
                "secondTitle": "Soft Skills",
                "secondValue": "Projektmanagement, Ressourcenplanung, Agile Entwicklung, Kommunikation, Consulting",
                "description": "<p className='pb-5'>Ich habe zum ersten Mal von Blockchain im Jahr 2012 gehört und habe mir damals auch ein paar Bitcoin gekauft (allerdings nicht behalten). Erst ab 2018 hat mich die Blockchain-Technologie wirklich interessiert. Ich stellte fest, dass ich nicht aufhören konnte, mehr über Blockchain zu erfahren und zu lernen. Nach dem Lesen von drei bis vier Büchern, dem Ansehen von hunderten Youtube-Videos und dem Studium zahlreicher Whitepaper war ich bereit, mich intensiver damit zu beschäftigen. Ich wurde Teil eines Crypto-Projekts und durfte dort als Kundendienstmitarbeiter und Entwickler arbeiten. Ich konnte viele Einblicke in die Prozesse eines dezentralen Unternehmens gewinnen und habe während dieser Jahre auch fließend Englisch gelernt. Leider musste das Projekt aus finanziellen Gründen fast alle Mitarbeiter kündigen, die Erfahrung bleibt jedoch.</p>"
            },
            {
                "topic": "Gründung WenServices",
                "firstTitle": "Arbeitgeber",
                "firstValue": "Privat 2019 - Jetzt",
                "secondTitle": "Languages",
                "secondValue": "C# .NET, C++, JAVA, BAT, PS, VBScript, JS, HTML/CSS, SQL",
                "thirdTitle": "Tech",
                "thirdValue": "MS Teams, Git, MSSQL, Omnitracker, Mention, Oracle",
                "description": "<p className='pb-5'>Es war nun an der Zeit, selbst etwas aufzubauen. Im Dezember des vergangenen Jahres gründete ich zusammen mit einem Freund aus Dänemark WenServices. In unserer Freizeit leiten wir ein kleines Team und entwickeln ein Crypto-Management-SaaS-Produkt. Im vergangenen Jahr konnte ich viele Erfahrungen in den Bereichen Personalführung, Start-Up, Projektmanagement, Personalverantwortung, Kommunikation, Aquise, Content-Creation, Social Media, Blockchain-Entwicklung und vieles mehr sammeln. In dieser Zeit habe ich auf Solidity-Basis einen eigenen Token und die Blockchain-Website BetWithFriends entwickelt. Ich habe zahlreiche externe APIs angebunden, Bots geschrieben und mehrere Websites mit react.js und vue.js erstellt.</p>"
            },
            {
                "topic": "Hosting & Administration",
                "firstTitle": "Employee",
                "firstValue": "WenServices 2022 - Jetzt",
                "secondTitle": "Soft Skills",
                "secondValue": "Projektmanagement, Ressourcenplanung, Agile Entwicklung, Kommunikation, Consulting",
                "description": "<p className='pb-5'>Als Full-Stack-Entwickler und Gründer eines Start-Ups muss man sich natürlich nicht nur um Datenbanken und Software kümmern. Man muss auch Kenntnisse im Bereich Netzwerke und Hosting erwerben. Um unsere Microservices, Proxies und Websites zu hosten, habe ich viel Erfahrung mit AWS und dessen Umgebung gesammelt. Ich habe auch viel Erfahrung mit Docker, Kubernetes, Apache und verschiedenen Linux-Distributionen gesammelt. Bei Megatech hatte ich auch die Möglichkeit, Erfahrungen in der Virtualisierung mit VSphere zu sammeln und umzusetzen.</p>"
            }
        ]
    },
    "about": {
        "description": "<p>Most importantly, I am a loving husband, stepfather of 4 and proud of my life.</p><p className='mt-5'>For the past six years, I have been employed in the telecommunications industry, serving primarily B2B clients.<br />Through this role, I have gained valuable experience in communication, product development, and customer acquisition.<br />Currently, I serve as a Full Stack Developer and Project Manager.</p><p className='mt-5'>In 2018, I became interested in blockchain technology and have since been enthusiastic about the potential it holds.<br />I have worked for a cryptocurrency project in the customer service and development departments.</p><p className='mt-5'>In December of 2021, I founded WenServices, a software company that is developing a SaaS solution for crypto business management in our spare time. Through this venture, I have gained experience in managing start-up challenges, leading a small team, and handling various tasks. Due to the dispersed location of our team members, I have honed my skills in English communication andnegotiation.</p><p className='mt-5'>Additionally, I have taken courses in Solidity and have completed several projects using the Ethereum blockchain. As a Developer,Project Manager, and founder, I have developed a range of hard and soft skills.</p><p className='mt-5'>I am proficient in remote work and am committed to delivering exceptional results.</p>"
    }
}